-------SRNN-------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
simple_rnn_1 (SimpleRNN)     (None, 100)               11000
_________________________________________________________________
dense_1 (Dense)              (None, 100)               10100
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 606
=================================================================
Total params: 21,706
Trainable params: 21,706
Non-trainable params: 0
_________________________________________________________________
SRNN Layers:100
epochs:15
training_time:8.539734840393066sec
accuracy_tdv:56.66666626930237%


-------LSTM-------
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_1 (LSTM)                (None, 100)               44000
_________________________________________________________________
dense_3 (Dense)              (None, 100)               10100
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 606
=================================================================
Total params: 54,706
Trainable params: 54,706
Non-trainable params: 0
_________________________________________________________________
LSTM Layers:100
epochs:15
training_time:23.88262939453125sec
accuracy_tdv:73.33333492279053%


-------BI-LSTM-------
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
bidirectional_1 (Bidirection (None, 200)               88000
_________________________________________________________________
dense_5 (Dense)              (None, 100)               20100
_________________________________________________________________
dense_6 (Dense)              (None, 6)                 606
=================================================================
Total params: 108,706
Trainable params: 108,706
Non-trainable params: 0
_________________________________________________________________
BI-LSTM Layers:100
epochs:15
training_time:33.885942459106445sec
accuracy_tdv:98.33333492279053%


-------CNN + SRNN-------
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
time_distributed_1 (TimeDist (None, None, 2, 128)      3584
_________________________________________________________________
time_distributed_2 (TimeDist (None, None, 1, 128)      0
_________________________________________________________________
time_distributed_3 (TimeDist (None, None, 128)         0
_________________________________________________________________
simple_rnn_2 (SimpleRNN)     (None, 100)               22900
_________________________________________________________________
dense_7 (Dense)              (None, 100)               10100
_________________________________________________________________
dense_8 (Dense)              (None, 6)                 606
=================================================================
Total params: 37,190
Trainable params: 37,190
Non-trainable params: 0
_________________________________________________________________
CNN Filters:128
SRNN Layers:100
Strides:1
epochs:15
training_time:3.5194032192230225sec
accuracy_tdv:41.66666567325592%


-------CNN + LSTM-------
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
time_distributed_4 (TimeDist (None, None, 2, 128)      3584
_________________________________________________________________
time_distributed_5 (TimeDist (None, None, 1, 128)      0
_________________________________________________________________
time_distributed_6 (TimeDist (None, None, 128)         0
_________________________________________________________________
lstm_3 (LSTM)                (None, 100)               91600
_________________________________________________________________
dense_9 (Dense)              (None, 100)               10100
_________________________________________________________________
dense_10 (Dense)             (None, 6)                 606
=================================================================
Total params: 105,890
Trainable params: 105,890
Non-trainable params: 0
_________________________________________________________________
CNN Filters:128
LSTM Layers:100
Strides:1
epochs:15
training_time:7.327326059341431sec
accuracy_tdv:58.33333134651184%


-------CNN + Bi-LSTM-------
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
time_distributed_7 (TimeDist (None, None, 2, 128)      3584
_________________________________________________________________
time_distributed_8 (TimeDist (None, None, 1, 128)      0
_________________________________________________________________
time_distributed_9 (TimeDist (None, None, 128)         0
_________________________________________________________________
bidirectional_2 (Bidirection (None, 200)               183200
_________________________________________________________________
dense_11 (Dense)             (None, 100)               20100
_________________________________________________________________
dense_12 (Dense)             (None, 6)                 606
=================================================================
Total params: 207,490
Trainable params: 207,490
Non-trainable params: 0
_________________________________________________________________
CNN Filters:128
Bi-LSTM Layers:100
Strides:1
epochs:15
training_time:12.283958435058594sec
accuracy_tdv:78.33333611488342%
